app/controllers/movies_controller.rb

INSERT INTO `movies` (`created_at`, `genre`, `name`, `updated_at`) VALUES ('2013-04-15 13:25:19', 'Action and Adventure', 'Batman Begins', '2013-04-15 13:25:19')
---
  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 7 LIMIT 1
DELETE FROM `movies` WHERE `movies`.`id` = 7
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy